

//שם המגישים:
//יוסף סולימאן
//ריאן סויטאת





const num =123;// הגדרת משתנה מסוג מספר ובדיקתו
const result=// חישוב התוצאה הסופית על ידי המרת תנאים לוגיים למספרים (true = 1, false = 0)
Number(num%2==0||num%3==0||num%5==0)+// בדיקה אם המספר מתחלק ב-2 או ב-3 או ב-5 (לפחות באחד מהם)   true
Number(num%2==0&&num%3==0||num%3==0&&num%5==0||num%2==0&&num%5==0)+ // בדיקה אם המספר מתחלק בלפחות בזוג אחד של מספרים (2 ו-3, 3 ו-5, או 2 ו-5)  false
Number(num%2==0&&num%3==0&&num%5==0);// בדיקה אם המספר מתחלק בכל שלושת המספרים יחד (2ו 3 ו-5)     false
console.log(result);// הדפסת התוצאה הסופית למסך


//התוצאה היא אחד כי true+false+false = 1+0+0