
//שם המגישים:
//יוסף סולימאן
//ריאן סויטאת









function isPrime(num)// הגדרת פונקציה לבדיקת מספר ראשוני
{
if(num<2) return false; // בדיקה אם המספר קטן מ-2, ואם כן הוא אינו ראשוני
for(let i=2;i<=num;i++) // לולאה שבודקת חלוקה של המספר מ-2 ועד המספר עצמו
{
    if(num%i==0){// בדיקה אם המספר מתחלק ללא שארית
        return false;
    }
 return true;
}
}

for(let i=2;i<237;i++)// לולאה שעוברת על כל המספרים מ-2 ועד 236
    {
if(isPrime(i)){// בדיקה האם המספר הנוכחי הוא ראשוני על ידי קריאה לפונקציה
    console.log(i); // הדפסת המספרים הראשונים למסך
}
    }